fn main() {
    {
        let r;                      // ---------+-- 'a  r的生命周期开始
        {                                 //          |
            let x = 5;               // -+-- 'b  |       x的生命周期开始
            r = &x;                       //  |       |
        }                                 // -+       |       x的生命周期结束
                                          //          |
                                          //          |
        println!("r: {}", r);             //          |
    }                                     // ---------+       r的生命周期结束
}
